In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'ID': [1, 2, 3],
                    'Nombre': ['Ana', 'Luis', 'Carlos']})

df2 = pd.DataFrame({'ID': [1, 2, 4],
                    'Edad': [25, 30, 22]})

In [3]:
df1

   ID  Nombre
0   1     Ana
1   2    Luis
2   3  Carlos

In [4]:
df2

   ID  Edad
0   1    25
1   2    30
2   4    22

In [6]:
df_combinado = pd.merge(df1,df2, on= 'ID')
df_combinado

   ID Nombre  Edad
0   1    Ana    25
1   2   Luis    30

In [7]:
df_combinado = pd.merge(df1,df2, on= 'ID', how= 'outer')
df_combinado

   ID  Nombre  Edad
0   1     Ana  25.0
1   2    Luis  30.0
2   3  Carlos   NaN
3   4     NaN  22.0

In [8]:
df_combinado = pd.merge(df1,df2, on= 'ID', how='right')
df_combinado

   ID Nombre  Edad
0   1    Ana    25
1   2   Luis    30
2   4    NaN    22

In [9]:
df_combinado = pd.merge(df1,df2, on= 'ID', how='left')
df_combinado

   ID  Nombre  Edad
0   1     Ana  25.0
1   2    Luis  30.0
2   3  Carlos   NaN

In [10]:
df_indexado = pd.merge(df1,df2, left_index=True, right_index=True)
df_indexado

   ID_x  Nombre  ID_y  Edad
0     1     Ana     1    25
1     2    Luis     2    30
2     3  Carlos     4    22

Ejercicio 1

In [13]:
libros = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'titulo': ['El Quijote', 'La Odisea', 'Cien Años de Soledad', 'El Principito']
})

autores = pd.DataFrame({
    'ID': [1, 2, 3, 5],
    'nombre': ['Miguel de Cervantes', 'Homero', 'Gabriel García Márquez', 'J.K. Rowling']
})


libros_autores = pd.merge(libros, autores, on= 'ID')

In [16]:
libros

   ID                titulo
0   1            El Quijote
1   2             La Odisea
2   3  Cien Años de Soledad
3   4         El Principito

In [17]:
autores

   ID                  nombre
0   1     Miguel de Cervantes
1   2                  Homero
2   3  Gabriel García Márquez
3   5            J.K. Rowling

In [ ]:

libros_autores

   ID                titulo                  nombre
0   1            El Quijote     Miguel de Cervantes
1   2             La Odisea                  Homero
2   3  Cien Años de Soledad  Gabriel García Márquez

Ejercicio 2

In [ ]:
cursos = pd.DataFrame({
    'curso_id': [101, 102, 103],
    'nombre_curso': ['Introducción a Python', 'Data Science con Python', 'Machine Learning Avanzado']
})

inscripciones = pd.DataFrame({
    'curso_id': [102, 102, 101, 104],
    'fecha_inscripcion': ['2023-01-15', '2023-02-01', '2023-01-20', '2023-03-05']
})


cursos_inscripciones = pd.merge(cursos, inscripciones, on= 'curso_id', how = 'outer')

In [20]:
cursos

   curso_id               nombre_curso
0       101      Introducción a Python
1       102    Data Science con Python
2       103  Machine Learning Avanzado

In [21]:
inscripciones

   curso_id fecha_inscripcion
0       102        2023-01-15
1       102        2023-02-01
2       101        2023-01-20
3       104        2023-03-05

In [22]:
cursos_inscripciones

   curso_id               nombre_curso fecha_inscripcion
0       101      Introducción a Python        2023-01-20
1       102    Data Science con Python        2023-01-15
2       102    Data Science con Python        2023-02-01
3       103  Machine Learning Avanzado               NaN
4       104                        NaN        2023-03-05

In [23]:

cursos_inscripciones = pd.merge(cursos, inscripciones, on= 'curso_id', how = 'right')

In [24]:
cursos_inscripciones

   curso_id             nombre_curso fecha_inscripcion
0       102  Data Science con Python        2023-01-15
1       102  Data Science con Python        2023-02-01
2       101    Introducción a Python        2023-01-20
3       104                      NaN        2023-03-05